In [1]:
from Repositories.AdventureWorksRepository import Repository

In [2]:
server = ''
username = ''
password = ''
driver = '{ODBC Driver 17 for SQL Server}'
dbName = 'AdventureWorks'
trustedConnection = 'yes'

connectionString = f"DRIVER={driver};SERVER={server};DATABASE={dbName};UID={username};PWD={password};trusted_connection={trustedConnection};"

adventureWorkRepository = Repository(connectionString)

# Product

In [3]:
productDataFrame = adventureWorkRepository.getProductDataFrame()
productDataFrame

,PRODUCT_id,PRODUCT_name,PRODUCT_category,PRODUCT_sub_category,PRODUCT_colour,PRODUCT_prod_cost,PRODUCT_storage_quantity
0,707,"Sport-100 Helmet, Red",Accessories,Helmets,Red,13.0863,288
1,708,"Sport-100 Helmet, Black",Accessories,Helmets,Black,13.0863,324
2,709,"Mountain Bike Socks, M",Clothing,Socks,White,3.3963,180
3,710,"Mountain Bike Socks, L",Clothing,Socks,White,3.3963,216
4,711,"Sport-100 Helmet, Blue",Accessories,Helmets,Blue,13.0863,216
...,...,...,...,...,...,...,...
455,997,"Road-750 Black, 44",Bikes,Road Bikes,Black,343.6496,30
456,998,"Road-750 Black, 48",Bikes,Road Bikes,Black,343.6496,99
457,998,"Road-750 Black, 48",Bikes,Road Bikes,Black,343.6496,56
458,999,"Road-750 Black, 52",Bikes,Road Bikes,Black,343.6496,78
459,999,"Road-750 Black, 52",Bikes,Road Bikes,Black,343.6496,116

# Customer

In [4]:
customerDataFrame = adventureWorkRepository.getCustomerDataFrame()
customerDataFrame

,CUSTOMER_id,CUSTOMER_address,CUSTOMER_city,CUSTOMER_state,CUSTOMER_country,CUSTOMER_company_name
0,29698,#9900 2700 Production Way,Burnaby,British Columbia,Canada,Finer Riding Supplies
1,23899,"00, rue Saint-Lazare",Dunkerque,Nord,France,None
2,22458,"02, place de Fontenoy",Verrieres Le Buisson,Essonne,France,None
3,21058,"035, boulevard du Montparnasse",Verrieres Le Buisson,Essonne,France,None
4,26871,"081, boulevard du Montparnasse",Saint-Denis,Seine Saint Denis,France,None
...,...,...,...,...,...,...
19149,14549,Zur Lindung 7,Berlin,Hessen,Germany,None
19150,22522,Zur Lindung 7,Neunkirchen,Saarland,Germany,None
19151,14940,Zur Lindung 764,Paderborn,Hamburg,Germany,None
19152,17852,Zur Lindung 78,Berlin,Hamburg,Germany,None
19153,16057,Zur Lindung 787,München,Nordrhein-Westfalen,Germany,None

# Employee

In [5]:
employeeDataFrame = adventureWorkRepository.getEmployeeDataFrame()
employeeDataFrame

,EMPLOYEE_id,EMPLOYEE_first_name,EMPLOYEE_last_name,EMPLOYEE_city,EMPLOYEE_state,EMPLOYEE_country
0,285,Syed,Abbas,Bothell,Washington,United States
1,283,David,Campbell,Bellevue,Washington,United States
2,278,Garrett,Vargas,Calgary,Alberta,Canada
3,279,Tsvi,Reiter,Memphis,Tennessee,United States
4,277,Jillian,Carson,Duluth,Minnesota,United States
5,275,Michael,Blythe,Detroit,Michigan,United States
6,288,Rachel,Valdez,Berlin,Hamburg,Germany
7,287,Amy,Alberts,Renton,Washington,United States
8,276,Linda,Mitchell,Nevada,Utah,United States
9,282,José,Saraiva,Ottawa,Ontario,Canada
10,289,Jae,Pak,Cambridge,England,United Kingdom
11,290,Ranjit,Varkey Chudukatil,Bordeaux,Gironde,France
12,274,Stephen,Jiang,Redmond,Washington,United States
13,286,Lynn,Tsoflias,Melbourne,Victoria,Australia
14,280,Pamela,Ansman-Wolfe,Portland,Oregon,United States
15,284,Tete,Mensa-Annan,Cambridge,Massachusetts,United States
16,281,Shu,Ito,San Francisco,California,United States

# Day

In [6]:
DAY_date = adventureWorkRepository.getDayDataFrame()
DAY_date

       DAY_date DAY_MONTH_nr DAY_QUARTER_nr DAY_YEAR_nr
0    2011-06-27            6              2        2011
1    2011-09-06            9              3        2011
2    2012-05-24            5              2        2012
3    2012-08-03            8              3        2012
4    2013-04-21            4              2        2013
...         ...          ...            ...         ...
1119 2014-06-18            6              2        2014
1120 2012-06-09            6              2        2012
1121 2012-07-28            7              3        2012
1122 2013-12-02           12              4        2013
1123 2014-01-20            1              1        2014

[1124 rows x 4 columns]

# Order Details

In [7]:
orderDetailsData = adventureWorkRepository.getOrderDetailsDataFrame()
orderDetailsData

,ORDER_DETAIL_id,ORDER_HEADER_id,ORDER_DETAIL_order_quantity,ORDER_DETAIL_unit_price,DAY_date,EMPLOYEE_id,CUSTOMER_id,PRODUCT_id
0,1,43659,1,2024.994,2011-05-31,279.0,29825,776
1,2,43659,3,2024.994,2011-05-31,279.0,29825,777
2,3,43659,1,2024.994,2011-05-31,279.0,29825,778
3,4,43659,1,2039.994,2011-05-31,279.0,29825,771
4,5,43659,1,2039.994,2011-05-31,279.0,29825,772
...,...,...,...,...,...,...,...,...
121312,121313,75122,1,21.980,2014-06-30,NaN,15868,878
121313,121314,75122,1,8.990,2014-06-30,NaN,15868,712
121314,121315,75123,1,21.980,2014-06-30,NaN,18759,878
121315,121316,75123,1,159.000,2014-06-30,NaN,18759,879
121316,121317,75123,1,8.990,2014-06-30,NaN,18759,712